Imports Autodesk.AutoCAD.ApplicationServices
Imports Autodesk.AutoCAD.EditorInput
Imports Autodesk.AutoCAD.Geometry
Imports Autodesk.AutoCAD.DatabaseServices
Imports System.Drawing
Imports System.IO
Imports Exception = System.Exception
Imports OSGeo.MapGuide
Imports System.Net
Imports System.Windows.Forms
Public Class FormSemiAutoCreateParcels
    Public boolShow As Boolean = False
    Public PutchTemlate As String = "d:\Civil3DToolsUtility\FileResources\Sample\"
    Public PutchTemlateDwg As String = ""
    Public ArrayPropProjectParcels As String(,) = Nothing
    Public ArrayPropMleader As String(,) = Nothing
    Public ArrayProjectParcelMleaderProp As String(,) = Nothing
    Public ArrayTempParcelMleaderProp As String(,) = Nothing

    Public Sub New()

        ' Этот вызов является обязательным для конструктора.
        InitializeComponent()
        '\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
        '\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
        '2. категории земель проектируемого участка
        Dim Kategory As String() = {"Земли промышленности....", "Земли населенных пунктов", "Земли сельскохозяйственного назначения", "Земли особо охраняемых территорий и объектов", "Земли лесного фонда", "Земли водного фонда", "Земли запаса", "Категория не установлена"}
        ComboBox3.DataSource = Kategory
        '\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
        '3. разрешенное использование
        Dim ArrayUtilization As String() = {"1 Сельскохозяйственное использование", "1.1	Растениеводство", "1.2 Выращивание зерновых и иных сельскохозяйственных культур", "1.3 Овощеводство", "1.4	Выращивание тонизирующих, лекарственных, цветочных культур",
            "1.5 Садоводство", "1.6 Выращивание льна и конопли", "1.7	Животноводство", "1.8 Скотоводство", "1.9	Звероводство", "1.1 Птицеводство", "1.11 Свиноводство", "1.12 Пчеловодство", "1.13 Рыбоводство", "1.14 Научное обеспечение сельского хозяйства",
            "1.15 Хранение и переработка сельскохозяйственной продукции", "1.16 Ведение личного подсобного хозяйства на полевых участках", "1.17 Питомники", "1.18 Обеспечение сельскохозяйственного производства", "1.19 Сенокошение", "1.2 Выпас сельскохозяйственных животных",
            "2 Жилая застройка", "2.1 Для индивидуального жилищного строительства", "2.1.1 Малоэтажная многоквартирная жилая застройка", "2.2 Для ведения личного подсобного хозяйства (приусадебный земельный участок)", "2.3 Блокированная жилая застройка", "2.4	Передвижное жилье",
            "2.5 Среднеэтажная жилая застройка", "2.6 Многоэтажная жилая застройка (высотная застройка)", "2.7 Обслуживание жилой застройки", "2.7.1	Хранение автотранспорта", "3 Общественное использование объектов капитального строительства", "3.1 Коммунальное обслуживание",
            "3.1.1 Предоставление коммунальных услуг", "3.1.2 Административные здания организаций, обеспечивающих предоставление коммунальных услуг", "3.2 Социальное обслуживание", "3.2.1 Дома социального обслуживания", "3.2.2 Оказание социальной помощи населению",
            "3.2.3 Оказание услуг связи", "3.2.4	Общежития", "3.3	Бытовое обслуживание", "3.4 Здравоохранение", "3.4.1 Амбулаторно-поликлиническое обслуживание", "3.4.2	Стационарное медицинское обслуживание", "3.4.3 Медицинские организации особого назначения", "3.5 Образование и просвещение",
            "3.5.1 Дошкольное, начальное и среднее общее образование", "3.5.2 Среднее и высшее профессиональное образование", "3.6 Культурное развитие", "3.6.1 Объекты культурно-досуговой деятельности", "3.6.2 Парки культуры и отдыха", "3.6.3 Цирки и зверинцы",
        "3.7 Религиозное использование", "3.7.1 Осуществление религиозных обрядов", "3.7.2 Религиозное управление и образование", "3.8 Общественное управление", "3.8.1 Государственное управление", "3.8.2 Представительская деятельность", "3.9 Обеспечение научной деятельности",
        "3.9.1 Обеспечение деятельности в области гидрометеорологии и смежных с ней областях", "3.9.2 Проведение научных исследований", "3.9.3 Проведение научных испытаний", "3.10 Ветеринарное обслуживание", "3.10.1	Амбулаторное ветеринарное обслуживание",
        "3.10.2 Приюты для животных", "4 Предпринимательство", "4.1 Деловое управление", "4.2 Объекты торговли (торговые центры, торгово-развлекательные центры (комплексы)", "4.3 Рынки", "4.4 Магазины", "4.5 Банковская и страховая деятельность", "4.6 Общественное питание",
        "4.7 Гостиничное обслуживание", "4.8	Развлечение", "4.8.1 Развлекательные мероприятия", "4.8.2	Проведение азартных игр", "4.8.3 Проведение азартных игр в игорных зонах", "4.9 Служебные гаражи", "4.9.1 Объекты дорожного сервиса", "4.9.1.1 Заправка транспортных средств",
        "4.9.1.2 Обеспечение дорожного отдыха", "4.9.1.3 Автомобильные мойки", "4.9.1.4 Ремонт автомобилей", "4.1 Выставочно-ярмарочная деятельность", "5 Отдых (рекреация)", "5.1 Спорт", "5.1.1 Обеспечение спортивно-зрелищных мероприятий", "5.1.2	Обеспечение занятий спортом в помещениях",
        "5.1.3 Площадки для занятий спортом", "5.1.4 Оборудованные площадки для занятий спортом", "5.1.5 Водный спорт", "5.1.6 Авиационный спорт", "5.1.7 Спортивные базы", "5.2 Природно-познавательный туризм", "5.2.1 Туристическое обслуживание", "5.3 Охота и рыбалка", "5.4 Причалы для маломерных судов",
"5.5 Поля для гольфа или конных прогулок", "6 Производственная деятельность", "6.1 Недропользование", "6.2	Тяжелая промышленность", "6.2.1 Автомобилестроительная промышленность", "6.3 Легкая промышленность", "6.3.1 Фармацевтическая промышленность", "6.4 Пищевая промышленность", "6.5 Нефтехимическая промышленность",
"6.6 Строительная промышленность", "6.7 Энергетика", "6.7.1 Атомная энергетика", "6.8 Связь", "6.9 Склад", "6.9.1 Складские площадки", "6.1 Обеспечение космической деятельности", "6.11 Целлюлозно-бумажная промышленность", "6.12 Научно-производственная деятельность", "7 Транспорт", "7.1 Железнодорожный транспорт",
"7.1.1 Железнодорожные пути", "7.1.2 Обслуживание железнодорожных перевозок", "7.2 Автомобильный транспорт", "7.2.1 Размещение автомобильных дорог", "7.2.2 Обслуживание перевозок пассажиров", "7.2.3 Стоянки транспорта общего пользования", "7.3 Водный транспорт", "7.4 Воздушный транспорт", "7.5	Трубопроводный транспорт",
"7.6 Внеуличный транспорт", "8 Обеспечение обороны и безопасности", "8.1 Обеспечение вооруженных сил", "8.2 Охрана Государственной границы Российской Федерации", "8.3 Обеспечение внутреннего правопорядка", "8.4 Обеспечение деятельности по исполнению наказаний", "9 Деятельность по особой охране и изучению природы",
"9.1 Охрана природных территорий", "9.2 Курортная деятельность", "9.2.1 Санаторная деятельность", "9.3 Историко-культурная деятельность", "10 Использование лесов", "10.1 Заготовка древесины", "10.2 Лесные плантации", "10.3 Заготовка лесных ресурсов", "10.4 Резервные леса", "11 Водные объекты",
"11.1 Общее пользование водными объектами", "11.2 Специальное пользование водными объектами", "11.3 Гидротехнические сооружения", "12 Земельные участки (территории) общего пользования", "12.0.1 Улично-дорожная сеть", "12.0.2 Благоустройство территории", "12.1	Ритуальная деятельность",
"12.2 Специальная деятельность", "12.3 Запас", "13 Земельные участки общего назначения", "13.1 Ведение огородничества", "13.2 Ведение садоводства"}
        ComboBox4.DataSource = ArrayUtilization
        '\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
        '4. Цель предоставления
        Dim Purpose As String() = {"Для размещения объектов автомобильного транспорта", "Для размещения объектов железнолорожного транспорта", "Для размещения объектов воздушного транспорта", "Для размещения объектов электросетевого хозяйтсва", "Для размещения объектов газоснабжения", "Для размещения объектов водоснабжения", "Для размещения объектов комунального хозяйства"}
        ComboBox5.DataSource = Purpose
        '\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
        '5. вид кадастровых работ
        Dim VidCadastralWork As String() = {"Образование земельного участка из земель, находящихся в государственной или муниципальной собственности",
                                            "Образование земельного участка путем раздела земельного участка",
                                            "Образование земельного участка путем раздела с сохранением земельного участка, раздел которого осуществлен, в измененных границах",
                                            "Образование земельного участка из состава земельного участка, представляющего собой единое землепользование",
                                            "Образование земельного участка путем объединения земельных участков",
                                            "Образование земельного участка при создании искусственного земельного участка",
                                            "Образование земельного участка путем перераспределения земельных участков",
                                            "Образование земельного участка путем перераспределения земельных участков или земель, находящихся в государственной или муниципальной собственности",
                                            "Уточнение местоположения границ и (или) площади земельного участка",
                                            "Уточнение описания местоположения границ и (или) площади земельного участка с целью исправления ошибки в описании местоположения его границ и (или) площади",
                                            "Образование части земельного участка",
                                            "Уточнение части земельного участка",
                                            "Установление сервитута",
                                            "Установление публичного сервитута"}
        ComboBox6.DataSource = VidCadastralWork
        '\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
        '6.обоснование определение размера земельного участка
        Dim ArraySizeParcelDoc As String() = {"Приказ Минтранса РФ от 6 августа 2008 г. N 126 «Об утверждении Норм отвода земельных участков, необходимых для формирования полосы отвода железных дорог, а также норм расчета охранных зон железных дорог»",
                                              "Постановлением Правительства РФ от 2 сентября 2009 г. № 717 «О нормах отвода земель для размещения автомобильных дорог и (или) объектов дорожного сервиса»",
                                              "ГОСТ Р 55989-2014 «Магистральные газопроводы. Нормы проектирования на давление свыше 10 МПа. Основные требования», п.7.2.1 «Минимальная ширина полосы отвода земель для размещения МГ»",
                                              "СН 452-73 «Нормы отвода земель для магистральных трубопроводов»",
                                              "СН465-74 «Нормы отвода земель для электрических сетей напряжением 0.4-500 кВ»",
                                              "СН 461-74 «Нормы отвода земель для линий связи»"}
        ComboBox7.DataSource = ArraySizeParcelDoc
        '\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
        '7.обоснование изъятия
        Dim ArrayObosnovanie As String() = {"Изъятие земельного участка для государственных или муниципальных нужд (Земельный кодекс Российской Федерации от 25.10.2001 N 136-ФЗ, Ст.56.3)",
                                            "Резервирование земельного участка для государственных или муниципальных нужд (Земельный кодекс Российской Федерации от 25.10.2001 N 136-ФЗ, Ст.70.1)",
                                            "Установление публичного сервитута для прохода или проезда через земельный участок, в том числе в целях обеспечения свободного доступа граждан к водному объекту общего пользования и его береговой полосе (Земельный кодекс Российской Федерации от 25.10.2001 N 136-ФЗ, Ст.23)",
                                            "Установление публичного сервитута для размещения на земельном участке межевых знаков, геодезических пунктов государственных геодезических сетей, гравиметрических пунктов, нивелирных пунктов и подъездов к ним (Земельный кодекс Российской Федерации от 25.10.2001 N 136-ФЗ, Ст.23)",
                                            "Установление публичного сервитута для проведения дренажных и мелиоративных работ на земельном участке (Земельный кодекс Российской Федерации от 25.10.2001 N 136-ФЗ, Ст.23)",
                                            "Установление публичного сервитута для забора (изъятия) водных ресурсов из водных объектов и водопоя (Земельный кодекс Российской Федерации от 25.10.2001 N 136-ФЗ, Ст.23)",
                                            "Установление публичного сервитута для строительства, реконструкции, эксплуатации, капитального ремонта объектов электросетевого хозяйства, тепловых сетей, водопроводных сетей, сетей водоотведения, линий и сооружений связи, линейных объектов системы газоснабжения, нефтепроводов и нефтепродуктопроводов, их неотъемлемых технологических частей (Земельный кодекс Российской Федерации от 25.10.2001 N 136-ФЗ, Ст.39.37)",
                                            "Установление публичного сервитута для складирования строительных и иных материалов, размещение временных или вспомогательных сооружений (включая ограждения, бытовки, навесы) и (или) строительной техники, которые необходимы для обеспечения строительства, реконструкции, ремонта объектов транспортной инфраструктуры федерального, регионального или местного значения, на срок указанных строительства, реконструкции, ремонта (Земельный кодекс Российской Федерации от 25.10.2001 N 136-ФЗ, Ст.39.37)",
                                            "Установление публичного сервитута для устройства пересечений автомобильных дорог или железнодорожных путей с железнодорожными путями общего пользования на земельных участках, находящихся в государственной собственности, в границах полос отвода железных дорог, а также устройство пересечений автомобильных дорог или железнодорожных путей с автомобильными дорогами или примыканий автомобильных дорог к другим автомобильным дорогам на земельных участках, находящихся в государственной или муниципальной собственности, в границах полосы отвода автомобильной дороги (Земельный кодекс Российской Федерации от 25.10.2001 N 136-ФЗ, Ст.39.37)",
                                            "Установление публичного сервитута для размещения автомобильных дорог и железнодорожных путей в туннелях (Земельный кодекс Российской Федерации от 25.10.2001 N 136-ФЗ, Ст.23)",
                                            "Установление публичного сервитута для реконструкции, капитального ремонта участков (частей) инженерных сооружений, являющихся линейными объектами (Земельный кодекс Российской Федерации от 25.10.2001 N 136-ФЗ, Ст.23)",
                                            "Установление сервитута для обеспечения прохода и проезда через соседний земельный участок, строительства, реконструкции и (или) эксплуатации линейных объектов, не препятствующих использованию земельного участка в соответствии с разрешенным использованием, а также других нужд собственника недвижимого имущества, которые не могут быть обеспечены без установления сервитута (Гражданский кодекс Российской Федерации от 30.11.1994 N 51-ФЗ, Ст.274)",
                                            "Нет"}
        ComboBox8.DataSource = ArrayObosnovanie
        '\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
        'масштаб
        Dim MAnno As Integer = AcadFunction.FuncReadCurrentAnnotativeScaleDWG
        Dim ScaleM As Integer() = {MAnno, 20000, 15000, 12000, 10000, 8000, 7000, 5000, 2000, 1000, 500, 100, 50}
        ComboBox10.DataSource = ScaleM
        '\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
        '2. категории земель проектируемого участка
        Dim Label As String() = {"Номер ЗУ и Площадь", "Номер ЗУ"}
        ComboBox1.DataSource = Label
        '\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
        'путь к шаблону
        Dim myPath As System.Reflection.Assembly = System.Reflection.Assembly.GetExecutingAssembly() 'патч к сборке
        Dim PathFile As String = myPath.Location 'строка путь к файлу со сборкой
        'отделяем имя файла от папки
        Dim parentPatch1 As String = IO.Directory.GetParent(PathFile).FullName
        'определяем имя родительской папки для папки где находится сборка
        Dim parentPatch2 As String = IO.Directory.GetParent(parentPatch1).FullName
        Dim ArrayFilesDirTemlates As String() = Nothing
        Dim CountPutchTemplateDir As Integer = 0
        'находим все шаблоны
        If IO.Directory.Exists(parentPatch2 & "\FileResources\Sample\") Then
            PutchTemlate = parentPatch2 & "\FileResources\Sample\"
            For Each fileDwg As String In Directory.GetFiles(PutchTemlate)
                Try
                    Dim File1 As String = Path.GetFileName(fileDwg)
                    Dim ext As String = Path.GetExtension(fileDwg)
                    If ext Like ".dwg" Then
                        ReDim Preserve ArrayFilesDirTemlates(CountPutchTemplateDir)
                        ArrayFilesDirTemlates(CountPutchTemplateDir) = File1
                        If CountPutchTemplateDir = 0 Then
                            PutchTemlateDwg = fileDwg
                        End If
                        CountPutchTemplateDir += 1
                    End If
                Catch ex As ArgumentException
                End Try
            Next
        End If
        If IsArray(ArrayFilesDirTemlates) = True Then
            ComboBox9.DataSource = ArrayFilesDirTemlates
        Else
            MsgBox("Шаблон не найден. Макро прервано!!!")
            Me.Hide()
        End If
    End Sub
    Private Sub FormSemiAutoCreateParcels_Load(sender As Object, e As EventArgs) Handles MyBase.Load

    End Sub

    Private Sub Button1_Click(sender As Object, e As EventArgs) Handles Button1.Click
        boolShow = False
        Me.Hide()
    End Sub

    Private Sub Button2_Click(sender As Object, e As EventArgs) Handles Button2.Click
        boolShow = True
        Me.Hide()
    End Sub

    Private Sub ComboBox2_SelectedIndexChanged(sender As Object, e As EventArgs) Handles ComboBox2.SelectedIndexChanged

    End Sub

    Private Sub GroupBox1_Enter(sender As Object, e As EventArgs) Handles GroupBox1.Enter

    End Sub
End Class